{
  "Navbar": {
    "home": "Home",
    "Categories": "Categories",
    "Contact us": "Contact us",
    "About": "About",
    "language": "العربية"
  },
  "Part": {
    "Part 1": "Part 1",
    "Part 2": "Part 2",
    "Part 3": "Part 3",
    "Contact 1": "Utilize the provided Strapi API from the assessment to post user data into your Redux store. You are required to add one user into the 'users' collection and display this data in a table using a GET request. Ensure the implementation of Redux for state management, including both POST requests for adding a user and GET requests for displaying data in the table.",
    "Contact 2": "Implement a map using any library of your choice (Leaflet is recommended). Search for the coordinates of 'Digifly Company' on Google Maps, then place a tooltip at these coordinates. Ensure that the tooltip styling matches the provided design below.",
    "Contact 3": "Implement a text editor that precisely replicates the UI styles provided. It's essential to create the undo and redo functionalities from scratch, along with two additional features of your choice. You may use any package, but creating these functionalities from scratch will be advantageous. Ensure that all text editor functionalities are operational."
  }
  ,
  "Form":{
    "First": "First Name",
    "Second": "Second Name",
    "Mobile": "Mobile Number",
    "email": "Your email",
    "Send": "Send",
    "FirstNameRequired":"First name is required",
    "FirstNameMin":"The name must be at least 3 characters.",
    "FirstNameMax":"The name cannot exceed 25 characters.",
    "LastNameRequired":"Second name is required",
    "LastNameMin":"Second name must be at least 2 characters",
    "LastNameMax":"Second name must be 50 characters or less",
    "PhoneRequired":"Your Phone number is required",
    "PhoneMatches":"Please enter a valid Egyptian phone number starting with 010, 011, 012, or 015",
    "EmailRequire":"Email is required",
    "EmailAddress":"Invalid email address",
      
    "FirstNameValid": "First Name is available!",
    "LastNameValid": "Last Name is available!",
    "PhoneNameValid": "Phone  is available!",
    "EmailNameValid": "Email  is available!",
    "Valid":"Alright!",
    "Results":"Results"
  }
  ,
  "Map":{
    "CompanyName":"Digi",
    "CompanyNameSecond":"fly",
    "Message":"Company welcomes You"
  }
  ,"Toast":{
    "loading":"Loading..."
  }

}
